backend/controllers/ProductController.php

SELECT * FROM `product` WHERE `id`='4'
---
    protected function findModel($id)
    {
        if (($model = Product::findOne(['id' => $id])) !== null) {