backend/views/product/_form.php


    <?php $form = ActiveForm::begin(['options' => ['enctype' => 'multipart/form-data']]); ?>

    <?= $form->field($model, 'category_id')->dropDownList(
            ArrayHelper::map(Category::find()->all() , 'id', 'name')
    );?>
---
SELECT * FROM `category`